// Εργασία 4, άσκηση 3.
// Υλοποίηση με while.

#include <stdio.h>

int main()
{
    int N, nums_entered, num, sum_3, mult_4, mult_neg, count_3;
    double avg = 0;
    
    // Ζητάμε από το χρήστη να εισάγει πόσους άρτιους αριθμούς θέλει.
    printf("Enter the amount of even numbers you want: ");
    scanf("%d", &N);
    
    // Αρχικοποιούμε τις μεταβλητές που θα μας χρειαστούν για το while.
    // Τα στοιχεία που χρειάζονται για τον πολλαπλασιασμό αρχικοποιούνται με 1
    // καθώς είναι το ουδέτερο στοιχείο πολλαπλασιασμού και στην πρόσθεση είναι το 0.
    nums_entered = 0;
    sum_3 = 0;
    mult_4 = 1;
    mult_neg = 1;
    count_3 = 0;
    
    // Ελέγχουμε την συνθήκη της επανάληψης και ξέρουμε ότι θα τρέξει
    // την πρώτη φορά καθώς η αρχική τιμή που έχουμε δώσει είναι μικρότερη από Ν.
    while (nums_entered < N)
    {
        printf("Enter a number: ");
        scanf("%d", &num);
        
        while (num%2 != 0) // Ελέγχουμε εάν έχουμε άρτιο αριθμό.
        {
            // Αν δέν είναι άρτιος τότε τελειώνει εδώ η επανάληψη και πάμε στην επόμενη.
            printf("You did not enter an even number.\n");
            printf("Please try again.\n");
            printf("Enter a number: ");
            lescanf("%d", &num);
        }
        
        // Εάν εισάγαμε άρτιο αριθμό ανεβαίνει η μεταβλητή ελέγχου κατα ένα.
        nums_entered++;
        
        // Ελέγχουμε εάν ο αριθμός είναι πολλαπλάσιο του 3.
        if (num % 3 == 0)
        {
            // Αθροίζουμε τους αριθμούς που είναι πολλαπλάσια του 3 και
            // αυξάνουμε τον μετρητή για το πλήθος αυτών των αριθμών ώστε
            // να υπολογίσουμε τον μέσο όρο τους.
            sum_3 += num;
            count_3++;
        }
        
        // Ελέγχουμε εάν ο αριθμός είναι πολλαπλάσιο του 4.
        if (num % 4 == 0)
            mult_4 *= num; // Εάν είναι τον πολλαπλασιάζουμε με του υπόλοιπους
        
        // Ελέγχουμε εάν ο αριθμός είναι αρνητικός.
        if (num < 0)
            mult_neg *= num; // Εάν είναι τον πολλαπλασιάζουμε με του υπόλοιπου
    }
    
    
    printf("\n");
    // Εάν το count_3 είναι μεγαλύτερο του 0 σημαίνει ότι έχουμε εισάγει τουλάχιστον έναν
    // αριθμό που είναι πολλαπλάσιο του 3 άρα τυπώνουμε τον μέσο όρο, αλλιώς τυπώνουμε
    // ότι δεν υπάρχουν τέτοιοι αριθμοί.
    if (count_3 > 0)
    {
        avg = (double) sum_3 / count_3;
        printf("The average of all numbers that were multiples of 3: %lf\n", avg);
    }
    else
        printf("No numbers entered that were multiples of 3.\n");
    
    // Εφόσον πολλαπλασιάζουμε μόνο τα πολλαπλάσιοα του 4 εάν έχει εισαχθεί κάποιος
    // τέτοιος αριθμός η τιμή του mult_4 θα έχει αλλάξει και θα τυπώσουμε το γινόμενο,
    // αλλιώς τυπώσουμε ότι δεν υπάρχουν τέτοιοι αριθμοί.
    if (mult_4 != 1)
        printf("The product of all numbers that were multiples of 4: %d\n", mult_4);
    else
        printf("No numbers entered that were multiples of 4.\n");
    
    // Εφόσον πολλαπλασιάζουμε μόνο άρτιους και αρνητικούς αριθμούς εάν έχει εισαχθεί κάποιος
    // τέτοιος αριθμός η τιμή του mult_neg θα έχει αλλάξει και θα τυπώσουμε το γινόμενο,
    // αλλιώς τυπώσουμε ότι δεν υπάρχαν τέτοιοι αριθμοί.
    if (mult_neg != 1)
        printf("The product of all numbers that were negative: %d\n", mult_neg);
    else
        printf("No numbers entered that were negative.\n");
    
    return 0;
}

