#include <stdio.h>
#include <math.h>

#define PI 3.14159265

int main()
{
    double x, previous, current, result;
    // y είναι η τιμή του εκθετικού και το αρχικοποιούμε με 3
    // καθώς ξεκινάμε να υπολογίζουμε τους όρους από τον 2ο
    int sign = -1,  y = 3;
    
    // Εισάγουμε αριθμό και ελέγχουμε εάν βρίσκεται μεταξύ 0 και 2π
    // και το πρόγραμμα προχωράει μέχρι ο χρήστης να εισάγει κατάλληλο αριθμό.
    printf("Enter x in rads to compute sin(x): ");
    scanf("%lf", &x);
    while (x < 0 || x > 2*PI)
    {
        printf("x not between 0 and 2*PI.\n");
        printf("Please try again.\n");
        printf("Enter x in rads to compute sin(x): ");
        scanf("%lf", &x);
    }
    
    // Ουσιαστικά επειδή το πρόγραμμα είναι σαν να ξεκινάει να υπολογίζει από
    // τον δεύτερο όρο ορίζουμε την τρέχουσα τιμή και την υπλογισμένη μέχρι στιγμής τιμή ώς x.
    result = x;
    current = x;
    do
    {
        // 
        previous = current;
        current = previous * x*x / (y*(y-1)); // Υπολογίζουμε τον τρέχον όρο.
        // Πολλαπλασιάζουμε το τρέχον αποτέλεσμα με το πρόσημα και το αλλάζουμε σε κάθε επανάληψη,
        // καθώς μια προστίθενται και μία αφαιρούνται οι όροι.
        result = result + current * sign;
        sign = sign * -1;
        y += 2; // Η τιμή του εκθετικού του παρονομαστή αυξάνεται ανα 2 για κάθε όρο.
    } while(fabs(current - previous) >= 0.000001); // Συγκρίνουμε την συνθήκη τερματισμού της επανάληψης.
    
    // Τυπώνουμε την τιμή που βρήκαμε και το αποτέλεσμα με χρήση της έτοιμης συνάρτησης sin
    // ώστε να συγκρίνουμε τα αποτελέσματα.
    printf("%lf\n", result);
    printf("%lf\n", sin(x));
    return 0;
}

